#+title: ObjC [1.75] libffi, cffi, cffi-grovel, and C
#+date: 2025-12-30
#+layout: post
#+math: true
#+options: _:nil ^:nil
#+categories: lisp
* 如何使用 libffi
尽管可以依赖网上搜的教程, [[https://www.chiark.greenend.org.uk/doc/libffi-dev/html/index.html][libffi 文档]],
或者可以参考 [[https://www.youtube.com/watch?v=0o8Ex8mXigU][This Library is a Hidden Gem, Tsoding]] ([[https://www.bilibili.com/video/BV1Pg1SBfE7w/][bilibili]]),
或者可以直接问 AI.

#+html: <details><summary>可以问 AI, 但是问 AI 好像不太行</summary>
我猜这是可能是因为用的 macOS 内置的 libffi:

#+begin_src shell
pkg-config libffi --cflags
#+end_src

#+RESULTS:
: -I/Library/Developer/CommandLineTools/SDKs/MacOSX26.sdk/usr/include/ffi

所以导致了和 AI 常见的 libffi 有所出入... (当然, 更有可能是因为没啥训练语料,
所以 AI 在乱说, 所以更建议是问完 AI 之后自己再修改一下 -- 不过试过几遍之后,
可能会发现还不如自己直接写 -- 问 AI 也是要时间的嘛.
#+html: </details>

因为我的目标是要能够调用 ObjC 中的方法, 所以这里尝试给 ObjC 中的 Type Encoding
都尽可能地测一边: 该如何调用 [[https://github.com/li-yiyang/coca/blob/cfb71ae5564b73b3304bbd765fc6b63078b480b3/objc/encoding.lisp#L163][ObjC encoding]].

| ObjC encoding                                      | ~ffi_type~                                  |
|----------------------------------------------------+---------------------------------------------|
| ~:char~                                            | ~ffi_type_sint8~                            |
| ~:unsigned-char~, ~:bool~                          | ~ffi_type_uint8~                            |
| ~:int~                                             | ~ffi_type_sint32~                           |
| ~:unsigned-int~                                    | ~ffi_type_uint32~                           |
| ~:short~                                           | ~ffi_type_sint16~                           |
| ~:unsigned-short~                                  | ~ffi_type_uint16~                           |
| ~:long~, ~:long-long~                              | ~ffi_type_sint64~                           |
| ~:unsigned-long~, ~:unsigned-long-long~            | ~ffi_type_uint64~                           |
| ~:float~                                           | ~ffi_type_float~                            |
| ~:double~                                          | ~ffi_type_double~                           |
| ~:string~, ~:object~, ~:class~, ~:sel~, ~:unknown~ | ~ffi_type_pointer~                          |
| ~:void~                                            | ~ffi_type_void~                             |
| ~:struct~                                          | ~ffi_type_struct~ (should manually specify) |
| ~:union~                                           | ?                                           |
| ~:bits~                                            | ?                                           |
| ~:array~                                           | ?                                           |

使用 =man ffi_call= 命令可以获得一个最简单的调用的例子, 这里仿照其结果以及用
在 [[{{site.github.url}}/lisp/objc-ns-exception/][ObjC [1.5]​]] 中提到的 =coca_objc_msgSend= 思路实现的一个 =ffi_call= wrapper
来作为例子.

#+html: <details><summary>点击展开折叠的例子</summary>
#+begin_src objc
#import <Foundation/Foundation.h>
#include <ffi.h>

void coca_objc_msgSend (ffi_cif *cif, IMP imp, void* retval, void** args) {
  NSLog(@"coca_objc_msgSend");
  @try {
    ffi_call(cif, FFI_FN(imp), retval, args);
  }
  @catch (NSException *e) {
    NSLog(@"Safe: %@", e);
  }
}

int main (int argc, char **argv) {
  <<ffi_calling_code_here>>
}
#+end_src

不过这里更加推荐直接查看 =objc/wrapper.lisp= 中的代码作为默认的策略.
#+html: </details>

